In [1]:
from sqlalchemy import create_engine
import sqlalchemy
import mysql

# importo pandas y numpy:
import numpy as np
import pandas as pd 

SQLServer='mysql.3utilities.com'

In [2]:
# cadena de conexión
user='nuclio20'
password='Nuclio20Mad321'
bbdd='scott20db'
#sCadenaConexion = "mysql+mysqlconnector://nuclio1:Nuclio1Mad321@sqllab.sytes.net/scott1db"
sCadenaConexion = "mysql+mysqlconnector://"+user+":"+password+"@"+SQLServer+"/"+bbdd
# Pintamos la cadena de conexion:
print(sCadenaConexion)
# instanciamos engine como resultado de create_engine
con = create_engine(sCadenaConexion).connect()

mysql+mysqlconnector://nuclio20:Nuclio20Mad321@mysql.3utilities.com/scott20db

In [ ]:
def con_bbdd(user, server='mysql.3utilities.com'):
    password  = f'{user.capitalize()}Mad321'
    bbdd      = f'scott{ user[6:] }db'
    sConexion = f'mysql+mysqlconnector://{user}:{password}@{server}/{bbdd}'
    con = create_engine(sConexion).connect()
    return con

# JOINS

![title](http://mysql.3utilities.com/resources_classes/Data-Base.JPG)

In [3]:
# Leemos la tabla customers en un DataFrame
df_customers=pd.read_sql("SELECT * FROM customers", con=con)

In [4]:
# Leemos la tabla orders en un DataFrame
df_orders=pd.read_sql("SELECT * FROM orders", con=con)

In [5]:
df_customers

  cust_id    name country
0       a   Alice      us
1       b     Bob      ca
2       c  Carlos      mx
3       d  Dieter      de

In [6]:
df_orders

   order_id cust_id  total
0         1       a   1539
1         2       c   1871
2         3       a   6352
3         4       b   1456
4         5       z   2137

# INNER JOIN
Hacemos el inner join de los dos dataset anteriores

![title](http://mysql.3utilities.com/resources_classes/Data-Base.JPG)


![title](http://mysql.3utilities.com/resources_classes/Inner-Join.JPG)

![title](http://mysql.3utilities.com/resources_classes/join_types.png)

## Lo hacemos con el DataFrame:

In [ ]:
df_pedidos=pd.merge(df_customers, df_orders, on=['cust_id'], how='inner')
df_pedidos

  cust_id    name country  order_id  total
0       a   Alice      us         1   1539
1       a   Alice      us         3   6352
2       b     Bob      ca         4   1456
3       c  Carlos      mx         2   1871

## Lo hacemos con la BBDD

In [ ]:
sSQL = """
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
INNER JOIN orders o ON c.cust_id=o.cust_id
ORDER BY 1
"""
pd.read_sql(sSQL, con=con)

  cust_id    name country  order_id  total
0       a   Alice      us         1   1539
1       c  Carlos      mx         2   1871
2       a   Alice      us         3   6352
3       b     Bob      ca         4   1456

## Si no queremos todos los campos, los borramos:

In [ ]:
df_customers.drop('country', axis=1)

  cust_id    name
0       a   Alice
1       b     Bob
2       c  Carlos
3       d  Dieter

In [ ]:
df_orders.drop('order_id', axis=1)

  cust_id  total
0       a   1539
1       c   1871
2       a   6352
3       b   1456
4       z   2137

In [ ]:
df_pedidos=pd.merge( df_customers.drop('country', axis=1) , df_orders.drop('order_id', axis=1) , on=['cust_id'], how='inner')
df_pedidos

  cust_id    name  total
0       a   Alice   1539
1       a   Alice   6352
2       b     Bob   1456
3       c  Carlos   1871

In [ ]:
sSQL = """
SELECT c.cust_id,name, total
FROM   customers c
INNER JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name  total
0       a   Alice   1539
1       c  Carlos   1871
2       a   Alice   6352
3       b     Bob   1456

# LEFT JOIN

Un Left Join **devuelve todos los elementos de la tabla de la izquierda** y sólo los elementos de la tabla derecha que machean con la tabla de la izquierda.

Es decir, la versión x de las columnas (de la tabla de la izquierda) consiste en todos los elementos de la tabla de la izquierda, los que machean y los que no, mientras que la versión y de las columnas (de la tabla de la derecha) sólo los elementas que machean con la tabla de la izquierda

Hacemos el left join de los dos dataset anteriores

![title](http://mysql.3utilities.com/resources_classes/left-joins-exp.JPG)


![title](http://mysql.3utilities.com/resources_classes/Left-Join.JPG)

![title](http://mysql.3utilities.com/resources_classes/join_types.png)

## Lo hacemos con el DataFrame:

In [ ]:
df_pedidos=pd.merge(df_customers,df_orders, on=['cust_id'], how='left')
df_pedidos

  cust_id    name country  order_id   total
0       a   Alice      us       1.0  1539.0
1       a   Alice      us       3.0  6352.0
2       b     Bob      ca       4.0  1456.0
3       c  Carlos      mx       2.0  1871.0
4       d  Dieter      de       NaN     NaN

## Lo hacemos en la base de datos:

In [ ]:
sSQL = """
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
LEFT JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name country  order_id   total
0       a   Alice      us       1.0  1539.0
1       c  Carlos      mx       2.0  1871.0
2       a   Alice      us       3.0  6352.0
3       b     Bob      ca       4.0  1456.0
4       d  Dieter      de       NaN     NaN

## Quitamos los campos que no queremos:

In [ ]:
df_pedidos=pd.merge( df_customers.drop('country', axis=1) , df_orders.drop('order_id', axis=1) , on=['cust_id'], how='left')
df_pedidos

  cust_id    name   total
0       a   Alice  1539.0
1       a   Alice  6352.0
2       b     Bob  1456.0
3       c  Carlos  1871.0
4       d  Dieter     NaN

In [ ]:
sSQL = """
SELECT c.cust_id,name, total
FROM   customers c
LEFT JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name   total
0       a   Alice  1539.0
1       c  Carlos  1871.0
2       a   Alice  6352.0
3       b     Bob  1456.0
4       d  Dieter     NaN

# RIGHT JOIN

Un **right join devuelve todos los registros de la tabla de la derecha** y los registros que machea de la tabla de la izquierda.

Es decir, la versión x de las columnas (del df de la izquierda) sólo mostraran los valores comunes y missing values, mientras que la versión y de las columnas mostrarán todos los valores, tanto los comunes como los únicos del segundo dataframe

Hacemos el right join de los dos dataset anteriores

![title](http://mysql.3utilities.com/resources_classes/right-joins-exp.JPG)


![title](http://mysql.3utilities.com/resources_classes/Right-Join.JPG)

![title](http://mysql.3utilities.com/resources_classes/join_types.png)

## Lo hacemos con el DataFrame:

In [ ]:
df_pedidos=pd.merge(df_customers,df_orders, on=['cust_id'], how='right')
df_pedidos

  cust_id    name country  order_id  total
0       a   Alice      us         1   1539
1       a   Alice      us         3   6352
2       b     Bob      ca         4   1456
3       c  Carlos      mx         2   1871
4       z     NaN     NaN         5   2137

## Lo hacemos en la base de datos:

In [ ]:
sSQL = """
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
RIGHT JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name country  order_id  total
0       a   Alice      us         1   1539
1       a   Alice      us         3   6352
2       b     Bob      ca         4   1456
3       c  Carlos      mx         2   1871
4    None    None    None         5   2137

## Quitamos los campos que no queremos:

In [ ]:
df_pedidos=pd.merge( df_customers.drop('country', axis=1) , df_orders.drop('order_id', axis=1) , on=['cust_id'], how='right')
df_pedidos

  cust_id    name  total
0       a   Alice   1539
1       a   Alice   6352
2       b     Bob   1456
3       c  Carlos   1871
4       z     NaN   2137

In [ ]:
sSQL = """
SELECT c.cust_id,name, total
FROM   customers c
RIGHT JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name  total
0       a   Alice   1539
1       a   Alice   6352
2       b     Bob   1456
3       c  Carlos   1871
4    None    None   2137

# OUTER JOIN
Con un outer join de dos dataframes conseguimos en general un dataframe con todos los elementos de ambos dataframes.

Es decir, un outer join devuelve **todos los registros si hay un match en cualquiera de las tablas de la derecha o izquierda**

Hacemos el outer join de los dos dataset anteriores:


![title](http://mysql.3utilities.com/resources_classes/Full-join.JPG)

![title](http://mysql.3utilities.com/resources_classes/join_types.png)

## Lo hacemos con el DataFrame:

In [ ]:
df_pedidos=pd.merge(df_customers,df_orders, on=['cust_id'], how='outer')
df_pedidos

  cust_id    name country  order_id   total
0       a   Alice      us       1.0  1539.0
1       a   Alice      us       3.0  6352.0
2       b     Bob      ca       4.0  1456.0
3       c  Carlos      mx       2.0  1871.0
4       d  Dieter      de       NaN     NaN
5       z     NaN     NaN       5.0  2137.0

In [ ]:
df_pedidos=pd.merge(df_customers.drop('country', axis=1), df_orders.drop('order_id', axis=1), on=['cust_id'], how='outer')
df_pedidos

  cust_id    name   total
0       a   Alice  1539.0
1       a   Alice  6352.0
2       b     Bob  1456.0
3       c  Carlos  1871.0
4       d  Dieter     NaN
5       z     NaN  2137.0

## Lo hacemos en la base de datos:

In [ ]:
sSQL = """
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
LEFT JOIN orders o ON c.cust_id=o.cust_id
UNION
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
RIGHT JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name country  order_id   total
0       a   Alice      us       1.0  1539.0
1       c  Carlos      mx       2.0  1871.0
2       a   Alice      us       3.0  6352.0
3       b     Bob      ca       4.0  1456.0
4       d  Dieter      de       NaN     NaN
5    None    None    None       5.0  2137.0

In [ ]:
sSQL = """
SELECT c.cust_id,name, total
FROM   customers c
LEFT JOIN orders o ON c.cust_id=o.cust_id
UNION
SELECT c.cust_id,name, total
FROM   customers c
RIGHT JOIN orders o ON c.cust_id=o.cust_id
"""
pd.read_sql(sSQL, con=con)

  cust_id    name   total
0       a   Alice  1539.0
1       c  Carlos  1871.0
2       a   Alice  6352.0
3       b     Bob  1456.0
4       d  Dieter     NaN
5    None    None  2137.0

# Agrupaciones

In [ ]:
sSQL = """
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
INNER JOIN orders o ON c.cust_id=o.cust_id
"""
df_pedidos=pd.read_sql(sSQL, con=con)

In [ ]:
df_pedidos

  cust_id    name country  order_id  total
0       a   Alice      us         1   1539
1       c  Carlos      mx         2   1871
2       a   Alice      us         3   6352
3       b     Bob      ca         4   1456

Vamos a agrupar por country y calcular la media del total:

In [ ]:
df_pedidos.groupby('country')['total'].mean()

country
ca    1456.0
mx    1871.0
us    3945.5
Name: total, dtype: float64

In [ ]:
df_pedidos.groupby('country').agg({'total':[np.mean, len]})

          total
           mean len
country
ca       1456.0   1
mx       1871.0   1
us       3945.5   2

In [ ]:
sSQL = """
SELECT country,AVG(total),count(*)
FROM (
SELECT c.cust_id,name,country,order_id, total
FROM   customers c
INNER JOIN orders o ON c.cust_id=o.cust_id) a
GROUP BY country

"""
pd.read_sql(sSQL, con=con)

  country  AVG(total)  count(*)
0      ca      1456.0         1
1      mx      1871.0         1
2      us      3945.5         2

In [ ]:
con.close()